AcDbCoordSystemRef.evaluateAndCacheGeometry
Calls evaluateAndCacheGeometry on all owned AcDbSubentRefs and then updates
the cached coordinate system.

AcDbCoordSystemRef.createEntity
There is no AcDbEntity created from AcDbCoordSystemRef.

AcDbCoordSystemRef
Coordinate system, actually an arbitrary matrix. The axes do not need to be
unit lengths, perpendicular, or form right-hand coord system (may be mirrored).
Remarks:  For internal use only.